In [2]:
import pandas as pd

In [3]:
data = pd.read_csv("ItemProfits11k.csv")

In [25]:
data = data.rename(index=str, columns={"title@": "title"})
data = data.dropna()

In [38]:
data.head()

,id,month,week,price,cost,profit,catid,title
0,20180726090450,2018-09,201835,78.00,34.50,43.50,551,Vintage Phil Austin Ice Fishermen Devils Lake ...
1,20180730104955,2018-09,201834,10.49,69.00,-58.51,360,Antique 18th C Fabio Berardi Italian Seaside S...
2,20180730094220,2018-09,201834,23.97,34.50,-10.53,360,Antique 19th C Nuremberg Henkersteg Bridge Cit...
3,20180807152117,2018-09,201835,89.00,69.00,20.00,592,Antique Rockingham Glazed Yellowware Stoneware...
4,20180731090728,2018-09,201834,46.00,42.17,3.83,360,Antique 18th C Samuel & Nathaniel Buck Kenilwo...

In [27]:
data.tail()

,id,month,week,price,cost,profit,catid,title
10995,20151223135006,2017-01,201704,45.00,10.00000,35.00000,592,"Antique c 1899 Cobalt Stenciled ""Zachman & Mye..."
10996,20170103125403,2017-01,201704,63.00,62.50000,0.50000,84622,"27"" Antique German Bisque Armand Marseille Do..."
10997,20170104081810,2017-01,201704,30.99,11.50000,19.49000,551,"Antique 19th c Mary Haines ""Afternoon Tea"" Sti..."
10998,20170111143740,2017-01,201704,22.50,52.40000,-29.90000,2734,Rene Lalique French Crystal Nina Ricci Coeur J...
10999,20170111112402,2017-01,201704,153.49,80.85009,72.63991,360,"1962 Marc ""Chagall et la Bible"" Moses & Tablet..."

In [43]:
cats = data.catid.unique()
month = data.month.unique()
week = data.week.unique()
len(week)

86

In [29]:
#data.groupby("catid").count()

In [44]:
columns_of_interest = ['month', 'week', 'price', 'cost', 'catid']
data_columns_of_interest = data[columns_of_interest]
data_columns_of_interest.head()

     month    week  price   cost  catid
0  2018-09  201835  78.00  34.50    551
1  2018-09  201834  10.49  69.00    360
2  2018-09  201834  23.97  34.50    360
3  2018-09  201835  89.00  69.00    592
4  2018-09  201834  46.00  42.17    360

In [31]:
price = data['price']
price.head()

0    78.00
1    10.49
2    23.97
3    89.00
4    46.00
Name: price, dtype: float64

In [32]:
y = data.price

In [33]:
predictors = ['week', 'cost', 'catid', 'month']
categorical_predictors = ['month','week', 'catid']
continuous_predictors = ['cost']
X = data[predictors]

In [41]:
from sklearn.preprocessing import LabelEncoder

In [42]:
le = LabelEncoder()

In [34]:
from sklearn.tree import DecisionTreeRegressor

In [36]:
model = DecisionTreeRegressor()

#X.dropna
model.fit(X,y)

DecisionTreeRegressor(criterion='mse', max_depth=None, max_features=None,
           max_leaf_nodes=None, min_impurity_split=1e-07,
           min_samples_leaf=1, min_samples_split=2,
           min_weight_fraction_leaf=0.0, presort=False, random_state=None,
           splitter='best')

In [37]:
print("Predict prices for the following items")
print(X.head())
print("Prediction...")
print(model.predict(X.head()))
# not even close

Predict prices for the following items
     week   cost  catid
0  201835  34.50    551
1  201834  69.00    360
2  201834  34.50    360
3  201835  69.00    592
4  201834  42.17    360
Prediction...
[ 78.          10.49        43.048       89.          30.35333333]